Repository: al-mahir/iOS
Catalog: Modules/Mualem/Sources/Mualem/Resources/Localizable.xcstrings
Source language: en
Languages: ar

source: %@ recognized
ar: تم التعرف على %@

source: %ld Verses
ar: %ld آية

source: 1x
ar: مرة واحدة

source: 3x
ar: ٣ مرات

source: 5x
ar: ٥ مرات

source: 10x
ar: ١٠ مرات

source: Accuracy
ar: الدقة

source: Almost
ar: قريب

source: Are you sure you want to stop this practice session?
ar: هل أنت متأكد من أنك تريد إنهاء جلسة التدريب هذه؟

source: Ayah %ld
ar: الآية %ld

source: Ayahs
ar: الآيات

source: Breakdown
ar: التفاصيل

source: Cancel
ar: إلغاء

source: Confidence: %ld%%
ar: نسبة الثقة: %ld٪

source: Connected
ar: متصل

source: Continue
ar: متابعة

source: Correct
ar: صحيح

# correctness_type_match
source: match
ar: تطابق

source: Disconnected
ar: غير متصل

source: Done
ar: تم

source: End Session
ar: إنهاء الجلسة

source: Engine: %@
ar: المحرك: %@

source: Error
ar: خطأ

# error_audio_engine_failed_format
source: Audio engine failed to start: %@
ar: فشل تشغيل محرك الصوت: %@

# error_audio_session_failed_format
source: Audio session setup failed: %@
ar: فشل إعداد جلسة الصوت: %@

# error_connection_failed_format
source: Connection failed: %@
ar: فشل الاتصال: %@

# error_connection_lost_format
source: Connection lost: %@
ar: فُقد الاتصال: %@

# error_decoding_failed_format
source: Decoding failed: %@
ar: فشل فك التشفير: %@

# error_invalid_url
source: Invalid URL path
ar: مسار الرابط غير صالح

# error_microphone_denied
source: Microphone permission was denied. Please enable it in Settings.
ar: تم رفض إذن الميكروفون. يرجى تفعيله من الإعدادات.

# error_protocol_error_format
source: Protocol error: %@
ar: خطأ في البروتوكول: %@

# error_recognizer_unavailable
source: Arabic speech recognition is not available on this device.
ar: التعرف على الكلام باللغة العربية غير متوفر على هذا الجهاز.

# error_server_unreachable
source: AI server is unreachable
ar: خادم الذكاء الاصطناعي غير متعذر الوصول إليه

# error_speech_recognition_denied
source: Speech recognition permission was denied. Please enable it in Settings.
ar: تم رفض إذن التعرف على الكلام. يرجى تفعيله من الإعدادات.

# error_unknown_format
source: Unknown error: %@
ar: خطأ غير معروف: %@

source: Evaluating...
ar: جاري التقييم...

source: Excellent!
ar: ممتاز!

source: Exit
ar: خروج

source: Expected %ld, you held %ld
ar: المتوقع %ld، وطولت %ld

source: From Ayah
ar: من آية

source: Hifz
ar: حفظ

source: Lenient
ar: تساهل

source: Listening...
ar: جاري الاستماع...

# mock_engine_offline
source: mock (offline)
ar: محاكي (غير متصل)

# mock_mistake_description
source: Mock mistake detected.
ar: تم كشف خطأ محاكى.

# mock_status_offline
source: offline
ar: غير متصل

# mock_word_1
source: Word1
ar: كلمة1

# mock_word_2
source: Word2
ar: كلمة2

# mock_word_3
source: Word3
ar: كلمة3

# mock_word_4
source: Word4
ar: كلمة4

source: Model uncertain — this may be correct
ar: النموذج غير متأكد — قد يكون هذا صحيحاً

source: Needs work
ar: يحتاج مراجعة

source: No Recitation Detected
ar: لم يتم التعرّف على تلاوة

source: None
ar: لا يوجد

source: Normal
ar: عادي

source: Not scored (chunk boundary)
ar: غير مقيّمة (حد المقطع)

source: Practice Again
ar: تدرب مرة أخرى

source: Ready
ar: جاهز

source: Repeat: %ld / %ld
ar: التكرار: %ld / %ld

source: Repetitions
ar: التكرارات

source: Reps
ar: التكرارات

source: Search surah name or number…
ar: ابحث عن اسم السورة أو رقمها…

source: Select Surah
ar: اختر السورة

source: Server Status
ar: حالة الخادم

source: Session Complete!
ar: اكتملت الجلسة!

source: Sifa
ar: صفة

# sifa_error_default
source: Articulation error
ar: خطأ في الصفات والمخارج

# speech_error_extra_word
source: Extra word inserted
ar: تمت إضافة كلمة زائدة

# speech_error_word_not_recited
source: Word was not recited
ar: لم يتم تلاوة الكلمة

# speech_error_wrong_word_format
source: Wrong word: expected "%1$@", heard "%2$@"
ar: كلمة خاطئة: المتوقع "%1$@"، المسموع "%2$@"

source: Start Session
ar: بدء الجلسة

source: Strict
ar: صارم

source: Strictness
ar: مستوى التدقيق

# strictness_lenient
source: Lenient
ar: مرن

# strictness_normal
source: Normal
ar: معتدل

# strictness_strict
source: Strict
ar: صارم

source: Surah %@
ar: سورة %@

source: Surah Selection
ar: اختيار السورة

source: Tajweed
ar: تجويد

# tajweed_error_default
source: Tajweed error
ar: خطأ تجويدي

# tajweed_error_length_format
source: %1$@: expected %2$d, you held %3$d
ar: %1$@: المتوقع %2$d، المقروء %3$d

source: Tashkeel
ar: تشكيل

# tashkeel_error_format
source: Tashkeel: expected "%1$@", heard "%2$@"
ar: التشكيل: المتوقع "%1$@"، المسموع "%2$@"

source: Teacher Mode Setup
ar: إعداد وضع المعلم

source: The AI model didn't hear clear recitation for this Ayah. Please tap Continue and try speaking clearly into your microphone.
ar: لم يسمع نموذج الذكاء الاصطناعي تلاوة واضحة لهذه الآية. يرجى الضغط على متابعة والمحاولة والتحدث بوضوح في الميكروفون.

source: To Ayah
ar: إلى آية

source: Top Error
ar: أكثر الأخطاء

source: Trimmed
ar: مقتطع

source: Verse Range
ar: نطاق الآيات

source: View Mistakes
ar: عرض الأخطاء

# word_not_recited_format
source: Word %d was not recited.
ar: لم يتم تلاوة الكلمة %d.

# ws_binary_send_error
source: WebSocket binary send error: %@
ar: خطأ أثناء إرسال بيانات ثنائية عبر WebSocket: %@

# ws_send_error
source: WebSocket send error: %@
ar: خطأ أثناء الإرسال عبر WebSocket: %@

source: Your turn...
ar: دورك الآن...
